Emacs.org
*** Show Line Numbers per Default, with some Exceptions
:PROPERTIES:
:ID:       fa826301-f5ae-4c2a-9280-84422f397ff0
:END:

#+begin_src emacs-lisp

(global-display-line-numbers-mode t)

;; Override some modes which derive from the above
(dolist (mode '(term-mode-hook
                shell-mode-hook
                eshell-mode-hook))
(add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src


** Programming
:PROPERTIES:
:ID:       10eecafe-1a33-4d5d-a162-6fc25c6f4791
:END:

*** Programming General
:PROPERTIES:
:ID:       da20042e-decb-467e-bae5-1f20bef5db7e
:END:

#+begin_src emacs-lisp
(require 'realgud)

(require 'setup-dired)
(require 'setup-wttrin)
(require 'setup-projectile)

;; Setup extensions
 (require 'setup-themes)
;; (eval-after-load 'ido '(require 'setup-ido)) ;; interactive break M-x
;; (eval-after-load 'dired '(require 'setup-python))

;; Setup lsp mode prior to setup-java
;; setup for lsp and dap
(require 'setup-auto-complete)

#+end_src

*** LSP
:PROPERTIES:
:ID:       b204e436-4dff-486d-8eac-8b32772d7574
:END:

-  often it is necessary to delete this file

  ~/.emacs.d/.lsp-session-v1


#+begin_src emacs-lisp
(require 'setup-lsp)
;; (require 'setup-java)
;; deactivate  jdee for  loading java files
  (setq auto-mode-alist
        (append '(("\\.java\\'" . java-mode)) auto-mode-alist))
(require 'setup-dap-mode)

#+end_src




*** LSP Python
:PROPERTIES:
:ID:       e06bb550-ccf7-4c8a-ba4d-c3d8343b4204
:END:

**** pyenv

https://github.com/pythonic-emacs/pyenv-mode
https://github.com/pyenv/pyenv

(pyenv-mode)
then run pyenv-mode-set

**** DAP Launching

#+begin_src emacs-lisp :tangle no
  ;; https://github.com/emacs-lsp/dap-mode/issues/202 DAP Breakpoints
  ;;
  ;; Launcher Example(s)
  ;;
  Endpoint to get a breakpoint into views when using manage.py
  (dap-debug
   (list :type "python"
         :args "runserver --noreload"
         :cwd "/home/audeering.local/cgeng/code/data_collection/aisoundlab/backend/app/"
         :module nil
         :console "integratedTerminal"
         :program "/home/audeering.local/cgeng/code/data_collection/aisoundlab/backend/app/manage.py"
         :request "launch"
         :name "Python: Django manage"
         :django t))
#+end_src

#+begin_src emacs-lisp :tangle no
  ;;
  ;; env vars do not work:
  ;; https://github.com/emacs-lsp/dap-mode/issues/202
  (dap-debug
   (list :type "python"
         :args "-s"
         :cwd "/home/audeering.local/cgeng/code/data_collection/aisoundlab/backend/app/study/tests/"
         :environment-variables '(("FOO" . "BAR"))
         :module nil
         :console "integratedTerminal"
         :program "/home/audeering.local/cgeng/code/data_collection/aisoundlab/backend/test.py"
         :request "launch"
         :name "Python: Django run unit test file"
         :django t))
#+end_src

**** Linting, Checkers, Static Code Analysis - Hooks

Overview about formatting, organizing imports and style checkers:
- https://zhauniarovich.com/post/2020/2020-04-starting-new-python-project/
- https://www.reddit.com/r/Python/comments/8oqy03/blog_a_comparison_of_autopep8_black_and_yapf_code/

Usefuly Hooks Article: https://enzuru.medium.com/helpful-emacs-python-mode-hooks-especially-for-type-hinting-c4b70b9b2216

***** Linting

****** Linters
;; pylint: .pylintrc

- pyright
- python-flake8  https://flake8.pycqa.org/en/latest/
- python-pylint
- python-pycompile
- python-pyright
- python-mypy

pip install  --upgrade pylint
pip install  --upgrade flake8


***** Code Formatting

****** Formatting providers in vscode

https://dev.to/adamlombard/how-to-use-the-black-python-code-formatter-in-vscode-3lo0

-  file->preferences->type "python formatting provider"
-  This gets put into ~/cgeng/.config/Code/User/settings.json
 "python.formatting.provider": "black"
- file->preferences->type "format on save"

-  configure black
-  https://dev.to/adamlombard/vscode-setting-line-lengths-in-the-black-python-code-formatter-1g62
 file->preferences->type "python formatting black args"
- --line-length 119
- 119 characters

***** Pyright Code Checking


****** Django Problem
;; https://github.com/microsoft/pyright/issues/1359
;; Django Stubs: https://pypi.org/project/django-stubs/


;; flycheck
;; using pyright in emacs lsp as well as in vscode gives identical errors except
;; false errors in emacs that are flagged as "lsp-flycheck-info-unnecessary"
;; https://github.com/emacs-lsp/lsp-mode/issues/2255



;; Vergleich der standard-Autoformatters:
;; https://www.kevinpeters.net/auto-formatters-for-python

;; Emacs LSP-Ansatz:
;; jede Sprache macht es selbst, also kein allgemeines setup f端r lsp und dap:
;; https://alpha2phi.medium.com/emacs-lsp-and-dap-7c1786282324

;; Format Imports Isort -
;; formatting using black and isort
;; https://cereblanco.medium.com/setup-black-and-isort-in-vscode-514804590bf9

;; autoflake will also remove unused imports using pyflakes (which is what flake8 uses to check for extra imports
;;  flycheck-pyflakes  20170330.2311 available  melpa      Support pyflakes in flyc
;; pip install autoflake
;; importmagic
;;
;; yapf stanza example for setup.cfg
;;
;;
;; [yapf]
;; based_on_style = pep8
;; spaces_before_comment = 4
;; split_before_logical_operator = true
;; line-length = 119

;; lisp function to auto-remove unused imports:
;; https://gist.github.com/kracekumar/77d29c7410199fd2cda4

;; linting
;; https://code.visualstudio.com/docs/python/linting
;; https://github.com/emacs-lsp/lsp-mode/issues/1327







***** Type Hinting
;; https://stackoverflow.com/questions/44094494/can-pycharm-suggest-or-autocomplete-or-insert-type-hints/44102211#44102211

***** Code Coverage in Emacs

- roll your own  ;; https://blog.laurentcharignon.com/post/universal-code-coverage/
- On Elpa:  pycoverage https://github.com/mattharrison/pycoverage.el
- not on elpa: https://github.com/wbolster/emacs-python-coverage/blob/master/python-coverage.el

#+begin_example
;;  cov                            20210330.44    available    melpa    Show coverage stats in the fringe.
;;  coverage                       20191113.1958  available    melpa    Code coverage line highlighting
;;  coverlay                       20190414.940   available    melpa    Test coverage overlays
#+end_example

**** Pyright

***** Build Pyright

Pylance = Pyright + IntelliCode AI models (not open-source)

#+begin_src bash :tangle no
https://github.com/emacs-lsp/lsp-mode/issues/1863:
entweder 端ber vs code installieren oder selbst bauen
git clone https://github.com/microsoft/pyright
cd pyright
npm i
npm run build:serverProd
;; das sorgt daf端r dass pyright bei mir im Pfad ist
;; which pyright
;; momentan befindet sich das hier: /home/audeering.local/cgeng/.nvm/versions/node/v12.22.1/bin/pyright
#+end_src

***** Use VS Code Version

#+begin_src emacs-lisp :tangle no
;; Nutzung der VSCode Version:
;; (setq lsp-pyright-server-cmd `("node" "~/.vscode/extensions/ms-python.vscode-pylance-2021.5.3/dist/pyright.bundle.js" "--stdio"))
;; (setq lsp-pyright-server-cmd `("node" "~/pyright/client/server/server.bundle.js" "--stdio"))
#+end_src

Activating venvs:
After changing the virtual env, the lsp workspace has to be restarted:
see https://github.com/emacs-lsp/lsp-pyright/issues/7

#+begin_src emacs-lisp :tangle no
(lsp-restart-workspace)
#+end_src

***** Configuration

- Pyright LS uses a file called pyrightconfig.json to include settings
This is documented at https://github.com/microsoft/pyright/blob/main/docs/configuration.md
- This also statest that pyright settings can also be specified in a [tool.pyright] section of a "pyproject.toml" file.
- some of these settings are also
 https://blog.pilosus.org/posts/2019/12/26/python-third-party-tools-configuration/
-  https://github.com/emacs-lsp/lsp-pyright
- hoe to devise local adaptions to PYTHONPATH under Emacs lsp pyright?
- there is a custom variable:
- python.analysis.extraPaths via lsp-pyright-extra-paths

-  PYTHONPATH  Setting py-pythonpath as a .dir-local seems not to work https://github.com/porterjamesj/virtualenvwrapper.el/issues/56
- What works though is the customization of lsp-pyright-extra-paths
- All variables that are accessible through Emacs as defcustom are here:
  https://github.com/emacs-lsp/lsp-pyright

code/data_collection/aisoundlab/audb_covid_19/1.0.0/


***** pyrightconfig.json example

Not sure whehter emacs interprets this at all

#+begin_src json :tangle no
{
    "exclude": ["**/node_modules", "**/__pycache__"],
    "ignore": ["**/node_modules", "**/__pycache__"],
    "include": ["flextensor", "tvm","1.0.0"],
    "pythonPlatform": "Linux",
    "pythonVersion": "3.7",
    "reportMissingImports": true,
    "reportMissingTypeStubs": false,
    "stubPath": "typings",
    "typeCheckingMode": "basic",
    "venvPath": "/home/audeering.local/cgeng/.venvs",
    "venv": "py37"
}

#+end_src


#+begin_src bash :tangle no

#+end_src


#+begin_src bash :tangle no

#+end_src

*****


**** Writing setup-python.el file  the  conf
:PROPERTIES:
:ID:       e1a1988b-a70a-435c-98e3-d95c61522659
:END:

***** Header
:PROPERTIES:
:ID:       6644930c-c376-4981-ae63-fc57ab4f5122
:END:

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  ;;; setup-python.el --- summary -*- lexical-binding: t -*-
  ;;
  ;;; Code:

  (message "Lsp Python begins here")
#+end_src


***** Function to restart Works端ace
:PROPERTIES:
:ID:       41f1d2b5-4526-4261-aaaf-00525bd8034c
:END:

see http://ergoemacs.org/emacs/elisp_file_name_dir_name.html

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
    (defun lsp-workspace-restart-deep ()
    (interactive
    (delete-file (joindirs user-emacs-directory  ".lsp-session-v1"))
    (lsp-workspace-restart))
    )

  ;;   ;;;###autoload
  ;; (defun toggle-menubar ()
  ;; "Toggle menubar visibility.
  ;; If toolbar is invisible, turn it on.  Otherwise turn it off."
  ;;   (interactive)
  ;;   (if (eq menu-bar-mode t)
  ;;       (menu-bar-mode -1)
  ;;           (menu-bar-mode t)

  ;; ))



#+end_src

#+RESULTS:
: lsp-workspace-restart-deep

(load-file "~/.emacs.d/init.el")

#+RESULTS:
: lsp-workspace-restart-deep



***** Format buffer using yapf
:PROPERTIES:
:ID:       674e2989-94c8-4dbe-976a-64ad936aa62c
:END:

see https://github.com/seagle0128/.emacs.d/blob/master/lisp/init-lsp.el

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes

  (defun python-yapf-format-buffer ()
     (interactive)
     (when (and (executable-find "yapf") buffer-file-name)
       (call-process "yapf" nil nil nil "-i" buffer-file-name)))

  ;; add hook example
  ;; (add-hook 'python-mode-hook
  ;;           (lambda ()
  ;;             (add-hook 'after-save-hook #'lsp-python-ms-format-buffer t t)))


#+end_src

***** Function to remove unused imports using autoflake
:PROPERTIES:
:ID:       5a5a162d-6b68-405d-9c47-02775e75271e
:END:

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  ;; does not work as custom variable
  ;; (defcustom python-autoflake-path
  ;;   (replace-regexp-in-string "\n$" "" (shell-command-to-string "which autoflake"))
  ;;   )

  (defvar python-autoflake-path
  (replace-regexp-in-string "\n$" "" (shell-command-to-string "which autoflake"))
  )

  (defun python-remove-unused-imports()
    "Use Autoflake to remove unused function"
    "autoflake --remove-all-unused-imports -i unused_imports.py"
    (interactive)
    (shell-command
     (format "%s --remove-all-unused-imports -i %s"
         python-autoflake-path
             (shell-quote-argument (buffer-file-name))))
    (revert-buffer t t t))
#+end_src

#+RESULTS:
: python-remove-unused-imports

***** Function to remove unused variables using autoflake
:PROPERTIES:
:ID:       9259bd8f-9cce-4f06-b262-d9f487959596
:END:

- this goes by using the --remove-unused-variables flag

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes


    (defun python-remove-unused-variables()
    "Use Autoflake to remove unused function"
    "autoflake --remove-all-unused-imports -i unused_imports.py"
    (interactive)
    (shell-command
     (format "%s --remove-unused-variables -i %s"
         python-autoflake-path
             (shell-quote-argument (buffer-file-name))))
    (revert-buffer t t t))

#+end_src

#+RESULTS:
: python-remove-unused-imports

***** Configure black formatter
:PROPERTIES:
:ID:       a7799b15-ad9f-4ab0-b55a-5ea7c6ef14e7
:END:

- blacken-buffer will format the buffer
- customizations are better kept in pyproject.toml, so the line length commneted out
- setup.cfg is interpreted by black

#+begin_src emacs-lisp
  (use-package use-package-ensure-system-package :ensure t)
  (use-package blacken
      :ensure t
      :ensure-system-package (black . "pip3 install black")
      ;; :custom
      ;; (blacken-line-length 119)
      )

#+end_src

***** Rst autocomplete
:PROPERTIES:
:ID:       59d7132f-71a6-45b0-88b8-a2f15e3952f2
:END:

https://github.com/tkf/auto-complete-rst

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  (require 'auto-complete-rst)
  (auto-complete-rst-init)

  ;; specify other sources to use in rst-mode
  (setq auto-complete-rst-other-sources
      '(ac-source-filename
        ac-source-abbrev
        ac-source-dictionary
        ac-source-yasnippet))
#+end_src



