el/setup-python.el
;;; setup-python.el --- summary -*- lexical-binding: t -*-
;;
;;; Code:

(message "Lsp Python begins here")

(defun python-yapf-format-buffer ()
   (interactive)
   (when (and (executable-find "yapf") buffer-file-name)
     (call-process "yapf" nil nil nil "-i" buffer-file-name)))

;; add hook example
;; (add-hook 'python-mode-hook
;;           (lambda ()
;;             (add-hook 'after-save-hook #'lsp-python-ms-format-buffer t t)))

;; does not work as custom variable
;; (defcustom python-autoflake-path
;;   (replace-regexp-in-string "\n$" "" (shell-command-to-string "which autoflake"))
;;   )

(defvar python-autoflake-path
(replace-regexp-in-string "\n$" "" (shell-command-to-string "which autoflake"))
)

(defun python-remove-unused-imports()
  "Use Autoflake to remove unused function"
  "autoflake --remove-all-unused-imports -i unused_imports.py"
  (interactive)
  (shell-command
   (format "%s --remove-all-unused-imports -i %s"
       python-autoflake-path
           (shell-quote-argument (buffer-file-name))))
  (revert-buffer t t t))

(defun python-remove-unused-variables()
"Use Autoflake to remove unused function"
"autoflake --remove-all-unused-imports -i unused_imports.py"
(interactive)
(shell-command
 (format "%s --remove-unused-variables -i %s"
     python-autoflake-path
         (shell-quote-argument (buffer-file-name))))
(revert-buffer t t t))

(require 'linum)
