Emacs.org
***** Main Conf Block
:PROPERTIES:
:ID:       028eb1d6-f3c4-40e1-8943-34a15fd269a9
:END:

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes

  (require 'linum)
  (require 'pycoverage)


  (defun my-coverage ()
    (interactive)
    (when (derived-mode-p 'python-mode)
      (progn
        (linum-mode)
        (pycoverage-mode))))

  (defconst python-linewidth 120)

  (use-package python-mode
    :ensure t
    :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (require 'highlight-indent-guides)
                           (auto-fill-mode)
                           (set-fill-column python-linewidth)
                           ;;(highlight-indent-guides-mode)

                           (lsp-deferred)
                           ;; (yapf-mode)
                           (lsp-treemacs)
                           )
                       )
    :custom
    ;; NOTE: Set these if Python 3 is called "python3" on your system!
    ;; (python-shell-interpreter "python3")
    ;; (dap-python-executable "python3")
    ;; should be .dir-local:
    ;; (lsp-pyright-venv-path "~/.venvs/py37")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python)
    ;; (setq lsp-pyright-server-cmd `("node" "~/.vscode/extensions/ms-python.vscode-pylance-2021.5.3/dist/pyright.bundle.js" "--stdio"))
    )


    (setq lsp-enable-file-watchers nil)
    (setq lsp-file-watch-threshold 2000)

    (setq lsp-pyright-auto-import-completions t)
    ;;  Determines whether pyright automatically adds common search paths.
    ;; i.e: Paths like "src" if there are no execution environments defined in the
    ;; config file.
    (setq lsp-pyright-auto-search-paths t)
    (setq lsp-pyright-log-level "trace")

  (require 'dap-python)

  ;; (lsp-client-settings)

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    ;; :bind (:map company-active-map
    ;;        ("<tab>" . company-complete-selection))
    ;;       (:map lsp-mode-map
    ;;        ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

  (use-package pyvenv
    :config
    (pyvenv-mode 1)
    ;; (setq pyvenv-workon "py37")  ; Default venv
    (pyvenv-tracking-mode 1)
    )  ; Automatically use pyvenv-workon via dir-locals

  (provide 'setup-python)

  ;;; setup-python-lsp-python ends here

#+end_src


#+begin_src emacs-lisp
  ;; not  lsp
  ;; (require 'setup-python-elpy-jedi)   ;; was the old setup-python.el
  ;; (require 'setup-python-lsp-emacs-from-scratch)
  ;; (require 'setup-python-pyright)
  ;; (require 'setup-python-lsp-pyright)
  ;; now: Alays write into setup-python and require so
  (require 'setup-python)
#+end_src

*** R
:PROPERTIES:
:ID:       f6b47430-8927-472c-99f9-dd3a7ce2cc4a
:END:

https://confunguido.github.io/blog/20190317_emacs_for_R.html
https://github.com/sejdemyr/.emacs.d/blob/master/init.el

#+begin_src emacs-lisp  :tangle ./el/setup-ess.el :mkdirp yes

  ;;; setup-ess.el --- summary -*- lexical-binding: t -*-
  ;;
  ;;; Code:

  (message "Lsp Python begins here")

        ;;; emacs speaks statistics
      (use-package ess
        :ensure t
        :init
        (require 'ess-site)
        )

  (provide 'setup-ess)
;;; setup-python-lsp-python ends here


#+end_src


