Emacs.org
*** Imenu auto
:PROPERTIES:
:ID:       820994eb-2700-428a-a80b-d5e0ede6299d
:END:
#+begin_src emacs-lisp

;; add Imenu whenever possible.
;; see https://www.emacswiki.org/emacs/ImenuMode for documentation
(defun try-to-add-imenu ()
  (condition-case nil (imenu-add-to-menubar "Index") (error nil)))
 (add-hook 'font-lock-mode-hook 'try-to-add-imenu)

#+end_src


*** Visible Bell off
:PROPERTIES:
:ID:       4b5650ad-478a-4c5e-8120-c56375abf02a
:END:

:PROPERTIES:
:ID:       6d9c48b7-0c81-4a42-a7f0-dfe149934fb2
:END:
#+begin_src emacs-lisp
(setq visible-bell t)
;; ring-bell function not doing what its supposed to?
;; see https://www.emacswiki.org/emacs/AlarmBell
;; (defun ring-bell-function()
;;   "do not ring the bell when cursor has gone too far outside."
;;   (message "Went outside but not ringing the bell.")
;;     )
#+end_src

*** Auth Source

- https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-Tips-Pass.org
- https://www.youtube.com/watch?v=nZ_T7Q49B8Y


(add-to-list 'auth-sources (joindirs org-directory "Notes.org.gpg")) ;; not parseable by authinfo
(find-file (joindirs org-directory "Notes.org.gpg"))



 (defun delete-nth (index seq)
   "Delete the INDEX th element of SEQ.
 Return result sequence, SEQ __is__ modified."
   (if (equal index 0)
       (progn
         (setcar seq (car (cdr seq)))
         (setcdr seq (cdr (cdr seq))))
     (setcdr (nthcdr (1- index) seq) (nthcdr (1+ index) seq))))

(delete-nth 0 auth-sources)

(add-to-list 'auth-sources (joindirs org-directory ".authinfo.gpg")) ;; not parseable
  (mapc 'message auth-sources)

(find-file (joindirs org-directory ".authinfo.gpg"))
(find-file (joindirs org-directory "Notes.org.gpg")) ;; no need to add to auth sources as not parseable
(auth-source-search :site "kaufland.de")
(auth-source-search :site "real.de")


#+begin_src emacs-lisp :tangle no :noweb yes
  (mapc 'message auth-sources)
#+end_src

#+RESULTS:
| ~/.authinfo | ~/.authinfo.gpg | ~/.netrc |

(auth-source-search :site  "arts-outdoors")
(auth-source-search :site  "arts-outdoors")

https://www.arts-outdoors.de

(auth-source-search :host "real.de")
(auth-source-search :machine "mailprovider.com")

(find-file (joindirs org-directory ".authinfo.gpg"))
(auth-source-forget-all-cached)
(find-file "~/.authinfo.gpg")
(mapc 'message auth-sources)

**** Generate Key

#+begin_example shell
gpg --full-generate-key
#+end_example

- use rsa
- size: 4096
- never expires
- Real Name
- Email
- PassPhrase

#+begin_src shell :tangle no :noweb yes :results output raw
  gpg --list-keys
  # these should be in
  ls -t ~/.gnupg/
#+end_src

#+RESULTS:
/home/christian/.gnupg/pubring.kbx
----------------------------------
pub   rsa4096 2021-08-21 [SC]
      B6791609BBC1CD7C000F17E75921C10409567BCA
uid           [ultimate] Christian Geng (my default key for storing encrypted passwords) <christian.c.geng@gmail.com>
sub   rsa4096 2021-08-21 [E]

trustdb.gpg
openpgp-revocs.d
pubring.kbx
private-keys-v1.d
pubring.kbx~

#+begin_src shell :tangle no :noweb yes :results output raw
# Check if gpg-agent is already running
grep gpg-agent
# If it's not running, you can start it up with this command:
gpg-connect-agent /bye
#+end_src

#+RESULTS:
22957



(defun efs/lookup-password (&rest keys)
  (let ((result (apply #'auth-source-search keys)))
    (if result
        (funcall (plist-get (car result) :secret))
        nil)))


*** Mac Specific
:PROPERTIES:
:ID:       7ef44450-4c70-4117-8a72-44d99a0138e3
:END:
#+begin_src emacs-lisp
;; Are we on a mac?
(setq is-mac (equal system-type 'darwin))
;; Setup environment variables from the user's shell.
(when is-mac (exec-path-from-shell-initialize))
;; (when is-mac (require 'mac))

#+end_src

*** calibredb
:PROPERTIES:
:ID:       632883c3-8739-4a79-bab9-87bc587dc8af
:END:


#+begin_src emacs-lisp

(require 'calibredb)
(setq calibredb-root-dir "/D/Calibre_Science/")
(setq calibredb-db-dir (expand-file-name "metadata.db" calibredb-root-dir))

    ;;(setq calibredb-root-dir "~/OneDrive/Doc/Calibre")
    ;;(setq calibredb-db-dir (expand-file-name "metadata.db" calibredb-root-dir))

#+end_src

#+RESULTS:
: /D/Calibre_Science/metadata.db



*** Ascidoctor

Link collection here:

https://www.emacswiki.org/emacs/AsciiDoc

**** Adoc Snippets

git@github.com:nicorikken/adoc-mode-yasnippet.git

see in snippets

**** open adoc files
:PROPERTIES:
:ID:       8ebfb281-87fd-49f7-b513-19a4c3b0b492
:END:

#+begin_src emacs-lisp
   (require 'adoc-mode)
  (add-to-list 'auto-mode-alist '("\.adoc$" . adoc-mode))
 ;;  (add-to-list adoc-mode '("\\.adoc\\'" . adoc-mode))
   (autoload 'adoc-mode "adoc-mode" nil t)
#+end_src

#+RESULTS:

**** adoc mode preview
:PROPERTIES:
:ID:       8f6ef9ec-ffa0-4e07-90c0-37f08216106a
:END:

#+begin_src emacs-lisp
  (defun rcd-command-output-from-input (program input &rest args)
    "Returns output from PROGRAM INPUT with optional ARGS"
    (let* ((output (with-temp-buffer
                     (insert input)
                     (apply #'call-process-region nil nil program t t nil args)
                     (buffer-string))))
      output))

  (defun rcd-asciidoctor (string &rest args)
    (interactive)
    "Returns plain text from Markdown by using pandoc"
    (apply 'rcd-command-output-from-input "asciidoctor" string "-" args))

  (defun rcd-asciidoctor-preview ()
    "Preview asciidoctor"
    (interactive)
    (let* ((output (rcd-asciidoctor (buffer-string)))
           (file (concat (or (getenv "TMPDIR") "/tmp/") "asciidoctor.html")))
      (with-temp-file file (insert output))
      (browse-url file)))

  ;; (global-set-key (kbd "C-c a") 'rcd-asciidoctor-preview)
#+end_src

*** Org ascidoc
:PROPERTIES:
:ID:       59738c74-4023-4a75-8180-a424222ba95e
:END:

Org ascidoc exporter
Repo is here: git clone git@github.com:yashi/org-asciidoc.git

#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/el/org-asciidoc")
  (require 'ox-asciidoc)
#+end_src

#+RESULTS:
: ox-asciidoc

*** Always load .local_configs as shell script
:PROPERTIES:
:ID:       7bdb08dc-a901-4bab-912b-50271f3f6f76
:END:
#+begin_src emacs-lisp
 (add-to-list 'auto-mode-alist '(".local_configs" . shell-script-mode))
#+end_src

** Emacs Server
:PROPERTIES:
:ID:       91011ca1-3a58-4d79-ba3a-21b27eb355b7
:END:

#+begin_src emacs-lisp
(require 'server)
(unless (server-running-p)
  (server-start))
#+end_src



* Applications Config Example

** Some App
:PROPERTIES:
:ID:       216fa964-a617-4a95-b3f4-3bd82856d8b1
:END:

This is an example of configuring another non-Emacs application using org-mode.  Not only do we write out the configuration at =.config/some-app/config=, we also compute the value that gets stored in this configuration from the Emacs Lisp block above it.

#+NAME: the-value
#+begin_src emacs-lisp :tangle no

  (+ 55 100)

#+end_src

*NOTE*: Set the =:tangle= parameter below to =.config/some-app/config= for this to work!

#+begin_src emacs-lisp :tangle no :noweb yes

  ;;  value=<<the-value()>>
  (setq value <<the-value()>>)

#+end_src

#+begin_src emacs-lisp :noweb yes

  ;;  value=<<the-value()>>
  (setq value <<the-value()>>)

#+end_src
