init-g.el

;; add Imenu whenever possible.
;; see https://www.emacswiki.org/emacs/ImenuMode for documentation
(defun try-to-add-imenu ()
  (condition-case nil (imenu-add-to-menubar "Index") (error nil)))
 (add-hook 'font-lock-mode-hook 'try-to-add-imenu)

(setq visible-bell t)
;; ring-bell function not doing what its supposed to?
;; see https://www.emacswiki.org/emacs/AlarmBell
;; (defun ring-bell-function()
;;   "do not ring the bell when cursor has gone too far outside."
;;   (message "Went outside but not ringing the bell.")
;;     )

;; Are we on a mac?
(setq is-mac (equal system-type 'darwin))
;; Setup environment variables from the user's shell.
(when is-mac (exec-path-from-shell-initialize))
;; (when is-mac (require 'mac))

(require 'calibredb)
(setq calibredb-root-dir "/D/Calibre_Science/")
(setq calibredb-db-dir (expand-file-name "metadata.db" calibredb-root-dir))

    ;;(setq calibredb-root-dir "~/OneDrive/Doc/Calibre")
    ;;(setq calibredb-db-dir (expand-file-name "metadata.db" calibredb-root-dir))

(require 'adoc-mode)
 (add-to-list 'auto-mode-alist '("\.adoc$" . adoc-mode))
;;  (add-to-list adoc-mode '("\\.adoc\\'" . adoc-mode))
  (autoload 'adoc-mode "adoc-mode" nil t)

(defun rcd-command-output-from-input (program input &rest args)
  "Returns output from PROGRAM INPUT with optional ARGS"
  (let* ((output (with-temp-buffer
                   (insert input)
                   (apply #'call-process-region nil nil program t t nil args)
                   (buffer-string))))
    output))

(defun rcd-asciidoctor (string &rest args)
  (interactive)
  "Returns plain text from Markdown by using pandoc"
  (apply 'rcd-command-output-from-input "asciidoctor" string "-" args))

(defun rcd-asciidoctor-preview ()
  "Preview asciidoctor"
  (interactive)
  (let* ((output (rcd-asciidoctor (buffer-string)))
         (file (concat (or (getenv "TMPDIR") "/tmp/") "asciidoctor.html")))
    (with-temp-file file (insert output))
    (browse-url file)))

;; (global-set-key (kbd "C-c a") 'rcd-asciidoctor-preview)

(add-to-list 'load-path "~/.emacs.d/el/org-asciidoc")
(require 'ox-asciidoc)

(add-to-list 'auto-mode-alist '(".local_configs" . shell-script-mode))

(require 'server)
(unless (server-running-p)
  (server-start))

;;  value=155
(setq value 155)
